tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="info">
	<clients>
		<client host="localhost" use_controller_vm="true"/>
	</clients>
	<servers>
		<server host="www.4chan.org" port="80" type="tcp">
		</server>
	</servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
     <users interarrival="2" unit="second"></users>
   </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="minute">
      <users interarrival="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="minute">
      <users interarrival="0.1" unit="second"></users>
    </arrivalphase>
  </load>
<sessions>
  <session name="http-example" probability="100" type="ts_http">

    <request> <http url="/" method="GET" version="1.1">
                    </http> </request>
    <request> <http url="/"
               method="GET" version="1.1"
               if_modified_since="Fri, 14 Nov 2003 02:43:31 GMT">
              </http></request>

    <thinktime value="20" random="true"></thinktime>

    <transaction name="index_request">
     <request><http url="/"
                          method="GET" version="1.1" >
              </http> </request>
     <request><http url="/"
                          method="GET" version="1.1">
              </http> </request>
    </transaction>
  </session>
</sessions>
</tsung>